Revit 2024 API
InsulationTypeSet Properties
The InsulationTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
Returns the number of insulation types that are in the set.
See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace